{"version":"https://jsonfeed.org/version/1","title":"Bugs with Blas","home_page_url":"https://bugswithblas.com/","feed_url":"https://bugswithblas.com/feed.json","description":"Hi, I'm Błażej Gutowski, and this is my personal portfolio and blog. After several years of experience as an IT administrator, I've transitioned into the exciting field of cybersecurity. Here, you'll find insights into my journey as a penetration tester, my professional portfolio, and a collection of blog posts covering topics like pentesting, vulnerability research, and bug hunting.","favicon":"https://bugswithblas.com//assets/favicon.ico","expired":false,"author":{"name":"Blazej Gutowski","url":"https://bugswithblas.com/"},"items":[{"id":"d57b65e8d43933d6897b89ea7f5e001d77de5360","title":"Passing the Burp Suite Certified Practitioner Exam - My Experience","summary":"After months of studying, practicing, and sharpening my skills, I am thrilled to share that I have passed the Burp Suite Certified Professional exam.","content_text":"After months of studying, practicing, and sharpening my skills, I am thrilled to share that I have passed the Burp Suite Certified Professional (BSCP) exam! You can view my certification here. This milestone is not only a validation of my expertise in web application security but also a stepping stone in my transition from IT administration to cybersecurity and ethical hacking.\nWhy I Chose the Burp Suite Certification Burp Suite is a leading tool for web application security testing, widely used by penetration testers and bug bounty hunters alike. Achieving this certification demonstrates proficiency in using Burp Suite to identify and exploit web application vulnerabilities effectively. For me, it was a logical choice to showcase my dedication to mastering the tools of the trade.\nPreparing for the Exam Preparation for the exam was both challenging and rewarding. Here\u0026rsquo;s how I approached it:\nUnderstanding Burp Suite Fundamentals: I ensured I was well-versed in Burp Suite\u0026rsquo;s essential features, like the Proxy, Repeater, Intruder, and Scanner. Hands-On Practice: Practice is key, so I spent countless hours using Burp Suite on real-world applications (in safe, legal environments like labs and practice platforms). Learning the OWASP Top Ten: Since many exam scenarios revolve around common web vulnerabilities, I dived deep into OWASP vulnerabilities, such as SQL Injection, Cross-Site Scripting (XSS), and Insecure Deserialization. Building Custom Tools: The exam also tests scripting and customization skills, so I familiarized myself with the Burp Extender API and basic Python scripting. The Exam Experience The BSCP exam is designed to test not just theoretical knowledge but also practical problem-solving abilities. It consists of:\nRealistic Scenarios: You are given a virtual environment with vulnerable applications and tasked with finding and exploiting issues. Time Management: With limited time to solve all challenges, staying calm and prioritizing tasks is crucial. Tool Proficiency: Knowing how to use Burp Suite effectively under pressure makes all the difference. Key Takeaways Practical Skills Matter: Unlike many certifications, the BSCP exam focuses on applying knowledge in a hands-on environment. This makes it highly relevant for real-world pentesting. Preparation Is Crucial: Familiarity with both the tool and the types of ","content_html":"\u003cp\u003eAfter months of studying, practicing, and sharpening my skills, I am thrilled to share that I have passed the \u003cstrong\u003eBurp Suite Certified Professional\u003c/strong\u003e (BSCP) exam! You can view my certification \u003ca href=\"https://portswigger.net/web-security/e/c/690adbbe21505dc3\"\u003ehere\u003c/a\u003e. This milestone is not only a validation of my expertise in web application security but also a stepping stone in my transition from IT administration to cybersecurity and ethical hacking.\u003c/p\u003e\n\u003ch2 id=\"why-i-chose-the-burp-suite-certification\"\u003eWhy I Chose the Burp Suite Certification\u003c/h2\u003e\n\u003cp\u003eBurp Suite is a leading tool for web application security testing, widely used by penetration testers and bug bounty hunters alike. Achieving this certification demonstrates proficiency in using Burp Suite to identify and exploit web application vulnerabilities effectively. For me, it was a logical choice to showcase my dedication to mastering the tools of the trade.\u003c/p\u003e\n\u003ch2 id=\"preparing-for-the-exam\"\u003ePreparing for the Exam\u003c/h2\u003e\n\u003cp\u003ePreparation for the exam was both challenging and rewarding. Here\u0026rsquo;s how I approached it:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eUnderstanding Burp Suite Fundamentals\u003c/strong\u003e: I ensured I was well-versed in Burp Suite\u0026rsquo;s essential features, like the Proxy, Repeater, Intruder, and Scanner.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eHands-On Practice\u003c/strong\u003e: Practice is key, so I spent countless hours using Burp Suite on real-world applications (in safe, legal environments like labs and practice platforms).\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eLearning the OWASP Top Ten\u003c/strong\u003e: Since many exam scenarios revolve around common web vulnerabilities, I dived deep into OWASP vulnerabilities, such as SQL Injection, Cross-Site Scripting (XSS), and Insecure Deserialization.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eBuilding Custom Tools\u003c/strong\u003e: The exam also tests scripting and customization skills, so I familiarized myself with the Burp Extender API and basic Python scripting.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2 id=\"the-exam-experience\"\u003eThe Exam Experience\u003c/h2\u003e\n\u003cp\u003eThe BSCP exam is designed to test not just theoretical knowledge but also practical problem-solving abilities. It consists of:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eRealistic Scenarios\u003c/strong\u003e: You are given a virtual environment with vulnerable applications and tasked with finding and exploiting issues.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eTime Management\u003c/strong\u003e: With limited time to solve all challenges, staying calm and prioritizing tasks is crucial.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eTool Proficiency\u003c/strong\u003e: Knowing how to use Burp Suite effectively under pressure makes all the difference.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2 id=\"key-takeaways\"\u003eKey Takeaways\u003c/h2\u003e\n\u003col\u003e\n\u003cli\u003e\u003cstrong\u003ePractical Skills Matter\u003c/strong\u003e: Unlike many certifications, the BSCP exam focuses on applying knowledge in a hands-on environment. This makes it highly relevant for real-world pentesting.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003ePreparation Is Crucial\u003c/strong\u003e: Familiarity with both the tool and the types of\u003c/li\u003e\n\u003c/ol\u003e\n","url":"https://bugswithblas.com/posts/passing-the-burp-suite-certified-professional-exam/","date_published":"22016-22-09T10:2222:00+01:00","date_modified":"22016-22-09T10:2222:00+01:00","author":{"name":"Blazej Gutowski","url":"https://bugswithblas.com/"}}]}