{
  "version": "https://jsonfeed.org/version/1",
  "title": "Bugs with Blas",
  "home_page_url": "http://localhost:52535/",
  "feed_url": "http://localhost:52535/feed.json",
  "description": "Hi, I'm Błażej Gutowski, and this is my personal portfolio and blog. After several years of experience as an IT administrator, I've transitioned into the exciting field of cybersecurity. Here, you'll find insights into my journey as a penetration tester, my professional portfolio, and a collection of blog posts covering topics like pentesting, vulnerability research, and bug hunting.",
  "favicon": "http://localhost:52535//assets/favicon.ico",
  "expired": false,
  "author": {
    "name": "Blazej Gutowski",
    "url": "http://localhost:52535/"
  },
  "items": [
    
    

    
    {
      "id": "f21ec4cb9bb6c8e62a50f46c8ab908353b1ba71c",
      "title": "How I Became a Burp Suite Certified Practitioner in 2025: Reflections and Tips",
      "summary": "Discover my journey to becoming a Burp Suite Certified Practitioner in 2025, including lessons learned, challenges faced, and tips for success in cybersecurity.",
      "content_text": "Introduction Did you know that the demand for certified cybersecurity professionals is expected to grow by 35% by 2025? Here’s how I navigated the challenges of becoming a Burp Suite Certified Practitioner and what I learned along the way.\nA Bit About Me To provide some context, let me share my background. I have nearly seven years of experience as an IT administrator, where I managed servers, networks, internal websites, and IT infrastructure. This role has given me a solid understanding of how applications and websites function, from the hardware level through servers and firewalls, all the way to the end user. These fundamentals have allowed me to grasp how web applications operate \u0026ldquo;in the background.\u0026rdquo;\nThroughout my education and career, I\u0026rsquo;ve also dabbled in coding, working on websites, Android apps, and scripts for internal use. While I wouldn\u0026rsquo;t label myself a programmer, I consider myself a capable code reader. I believe these experiences have provided me with a strong foundation to venture into penetration testing.\nWhy This Certification? At a certain point in my career, I felt the need for change. The \u0026ldquo;programming train\u0026rdquo; wasn\u0026rsquo;t appealing to me, and I found it challenging to build a portfolio that would lead to a well-paying job. Inspired by one of my favorite shows, Mr. Robot, I decided to take a leap and explore something new. After conducting a brief market reconnaissance, I set my sights on becoming a penetration tester.\nIn 2023, I began preparing for the OSCP certification but faced setbacks and ultimately didn\u0026rsquo;t pass. However, I decided to take a step back and focus on mastering Burp Suite. But enough about my journey—let\u0026rsquo;s dive into the Burp Suite Exam.\nOutline of the Article In this article, I want to share my experience of passing the Burp Suite Exam. I will provide tips, tricks, and resources that I found helpful along the way, as well as my feelings about the entire process. Whether you\u0026rsquo;re considering this certification or just curious about the world of penetration testing, I hope my insights will be valuable to you.\nPreparation Before diving into the Burp Suite Exam, there are a few essential things you should know. For a comprehensive list of requirements, check out the official PortSwigger certification page.\nOne crucial detail I initially overlooked was the need for a license for the Pro version of Burp Suite. While most of the requirements are relatively low, you will need to budget $449.00 for the Pro version if you don\u0026rsquo;t already have access to it, plus an additional $99 for the exam. If your current job provides access to Burp Suite, you can use that license. According to PortSwigger:\n\u0026ldquo;If you have a Burp Suite Professional license, but it is registered under an email domain of the company you work for rather than your personal email address, you will still be absolutely fine, from a technical perspective, to use that license for taking the exam. So long as you have access to a valid, active Burp Suite Professional license at the time of your certification, you will be able to use it to take the exam.\u0026rdquo;\nIf you have any concerns about using a company-registered license, it\u0026rsquo;s best to discuss this with your employer, as they can provide guidance.\nMaterials Here are the resources I personally utilized during my preparation:\nPortSwigger Topics and Labs: I covered all topics and labs except for the expert level. You can find them here. YouTube Community Solutions: I found valuable insights from channels like: Intigriti Jarno Timmermans PortSwigger Research Articles: These were particularly helpful for understanding concepts like request smuggling. Check them out here. Botesjuan Repository: This is a fantastic resource, especially for learning how to exploit vulnerabilities like XSS to steal cookies rather than just triggering alerts in the browser. You can find it here. Botesjuan YouTube Playlist: This playlist is a great companion resource, with shoutouts to z3nsh3ll and John Hammond. My Own Site: I created a site that mirrors the Botesjuan repository but offers better navigation and includes a section with all payloads. You can visit it here. Study Methods Initial Preparation My study approach was straightforward: I completed all topics and labs except for the expert ones. After that, I revisited and retook topics where I felt less confident, utilizing all the materials mentioned above—sometimes reading through them multiple times. I also tackled several mystery labs and completed a practice exam, which I highly recommend to familiarize yourself with the exam format.\nPortSwigger Methodology Following this, I revisited more mystery labs. You can follow the proposed methodology outlined on the PortSwigger website:\n\u0026ldquo;Work through the topics within the academy, completing every apprentice and practitioner-level lab as you go. As you reach the end of each topic, use the mystery labs feature to practice solving the labs with no contextual clues. When you\u0026rsquo;ve completed all the practitioner-level labs, practice solving mystery labs from all available topics to develop your recon and discovery skills. Then complete a practice exam to familiarize yourself with the exam format. Make sure to read the exam hints and tips, as they contain invaluable information that you\u0026rsquo;ll need to be successful in the exam.\u0026rdquo;\nOvercoming Challenges From my perspective, if a topic seems challenging, revisit it after taking the practice exam and work on it with mystery labs again. This approach helps solidify your understanding and builds confidence in tackling difficult areas.\nTime Commitment I began my preparation in May and passed the exam in January. Throughout this period, I was working full-time and had various personal commitments, including , brithdays, travels and holidays. Therefore, my timeline may not be representative of what others might experience. In hindsight, I believe that 5-6 months is a reasonable timeframe for preparation. However, if you are organized and have more time to dedicate, you could potentially complete it in 3-4 months. Keep in mind that everyone\u0026rsquo;s experience will vary.\nExam Experience The exam consists of two applications that closely resemble those found in the labs. Each application involves three main steps:\nGain access to a standard user account (the username is likely \u0026ldquo;carlos\u0026rdquo;). Elevate privileges to the administrator account. Retrieve the contents of the file located at /home/carlos/secret. For more details, you can read about the exam structure here.\nThe exam duration is four hours.\nMy Tips I passed the exam on my second attempt and discovered various approaches that can be effective. Here are my recommendations:\nStart with Active Scanning: Begin by actively scanning both applications simultaneously. This process may take some time, but it’s worth it. As you explore the websites, generate requests and, if you identify any interesting areas, run a scan for specific insertion points or requests.\nUtilize Two Screens: If possible, set up a dual-screen configuration. Use one larger screen for Burp Suite and the second for your study materials, protocol documentation, and the exam applications. This setup can significantly enhance your workflow.\nBe Aware of Obfuscation Techniques: Remember that the exam may not present obfuscation techniques in the same straightforward manner as the topics covered in the labs. While most labs utilize basic obfuscation, the exam may require you to employ different techniques. Stay alert and be prepared to adapt your strategies accordingly.\nSQL Injection Automation: During my first attempt, I struggled with SQL injection. For the second try I used the CO2 extension, which allows running sqlmap directly in the system terminal. This was a game-changer because it automated the injection process, freeing up my time to focus on other parts of the exam.\nExtensions and Tools Stick to the tools and techniques covered in the PortSwigger Academy topics and labs. Overcomplicating your approach with unfamiliar tools can waste valuable time. But use some time using it, or use some of newer ones like I used CO for SQL Injection.\nReflections Passing the Burp Suite Exam filled me with a profound sense of accomplishment and relief. The journey was challenging, but it ultimately deepened my passion for penetration testing and web security.\nFor those preparing for the exam, I want to emphasize that if you find your motivation waning after months or even years due to your current job, remember that achieving such milestones can reignite your drive. If you have doubts, I assure you that the feeling of passing is incredibly rewarding. I can relate to this personally; I created a blog from scratch and wrote this post in just four days. Two months ago, I would have thought that would take me forever.\nConclusion In summary, my journey to passing the Burp Suite Exam has been both rewarding and enlightening. The key takeaways from this experience include the importance of thorough preparation, the value of utilizing diverse resources, and the necessity of practicing with real-world scenarios.\nLooking ahead, I am eager to deepen my knowledge in the security field. My immediate plan is to gain more experience, hopefully in a new role as a penetration tester, while further developing my skills through CTF platforms and bug bounty programs. I also aspire to attempt the OSCP again and, one day, speak at DEF CON. This professional dream motivates me and provides a boost to my efforts.\nBecoming a Burp Suite Certified Practitioner was one of the most challenging yet rewarding experiences of my career. If I can do it, so can you—start your journey today! If you’re considering becoming a Burp Suite Certified Practitioner, I’d love to hear about your journey. For more tips on cybersecurity, penetration testing, CTFs and bug hunting, follow my blog.\u0026quot;\n",
      "content_html": "\u003ch2 id=\"introduction\"\u003eIntroduction\u003c/h2\u003e\n\u003cp\u003eDid you know that the demand for certified cybersecurity professionals is expected to grow by 35% by 2025? Here’s how I navigated the challenges of becoming a Burp Suite Certified Practitioner and what I learned along the way.\u003c/p\u003e\n\u003ch3 id=\"a-bit-about-me\"\u003eA Bit About Me\u003c/h3\u003e\n\u003cp\u003eTo provide some context, let me share my background. I have nearly seven years of experience as an IT administrator, where I managed servers, networks, internal websites, and IT infrastructure. This role has given me a solid understanding of how applications and websites function, from the hardware level through servers and firewalls, all the way to the end user. These fundamentals have allowed me to grasp how web applications operate \u0026ldquo;in the background.\u0026rdquo;\u003c/p\u003e\n\u003cp\u003eThroughout my education and career, I\u0026rsquo;ve also dabbled in coding, working on websites, Android apps, and scripts for internal use. While I wouldn\u0026rsquo;t label myself a programmer, I consider myself a capable code reader. I believe these experiences have provided me with a strong foundation to venture into penetration testing.\u003c/p\u003e\n\u003ch3 id=\"why-this-certification\"\u003eWhy This Certification?\u003c/h3\u003e\n\u003cp\u003eAt a certain point in my career, I felt the need for change. The \u0026ldquo;programming train\u0026rdquo; wasn\u0026rsquo;t appealing to me, and I found it challenging to build a portfolio that would lead to a well-paying job. Inspired by one of my favorite shows, \u003cem\u003eMr. Robot\u003c/em\u003e, I decided to take a leap and explore something new. After conducting a brief market reconnaissance, I set my sights on becoming a penetration tester.\u003c/p\u003e\n\u003cp\u003eIn 2023, I began preparing for the OSCP certification but faced setbacks and ultimately didn\u0026rsquo;t pass. However, I decided to take a step back and focus on mastering Burp Suite. But enough about my journey—let\u0026rsquo;s dive into the Burp Suite Exam.\u003c/p\u003e\n\u003ch3 id=\"outline-of-the-article\"\u003eOutline of the Article\u003c/h3\u003e\n\u003cp\u003eIn this article, I want to share my experience of passing the Burp Suite Exam. I will provide tips, tricks, and resources that I found helpful along the way, as well as my feelings about the entire process. Whether you\u0026rsquo;re considering this certification or just curious about the world of penetration testing, I hope my insights will be valuable to you.\u003c/p\u003e\n\u003ch2 id=\"preparation\"\u003ePreparation\u003c/h2\u003e\n\u003cp\u003eBefore diving into the Burp Suite Exam, there are a few essential things you should know. For a comprehensive list of requirements, check out the official \u003ca href=\"https://portswigger.net/web-security/certification/how-it-works#requirements\"\u003ePortSwigger certification page\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eOne crucial detail I initially overlooked was the need for a license for the Pro version of Burp Suite. While most of the requirements are relatively low, you will need to budget $449.00 for the Pro version if you don\u0026rsquo;t already have access to it, plus an additional $99 for the exam. If your current job provides access to Burp Suite, you can use that license. According to PortSwigger:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026ldquo;If you have a Burp Suite Professional license, but it is registered under an email domain of the company you work for rather than your personal email address, you will still be absolutely fine, from a technical perspective, to use that license for taking the exam. So long as you have access to a valid, active Burp Suite Professional license at the time of your certification, you will be able to use it to take the exam.\u0026rdquo;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eIf you have any concerns about using a company-registered license, it\u0026rsquo;s best to discuss this with your employer, as they can provide guidance.\u003c/p\u003e\n\u003ch3 id=\"materials\"\u003eMaterials\u003c/h3\u003e\n\u003cp\u003eHere are the resources I personally utilized during my preparation:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003ePortSwigger Topics and Labs\u003c/strong\u003e: I covered all topics and labs except for the expert level. You can find them \u003ca href=\"https://portswigger.net/web-security/all-topics\"\u003ehere\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eYouTube Community Solutions\u003c/strong\u003e: I found valuable insights from channels like:\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/@intigriti\"\u003eIntigriti\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.youtube.com/@netletic\"\u003eJarno Timmermans\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003ePortSwigger Research Articles\u003c/strong\u003e: These were particularly helpful for understanding concepts like request smuggling. Check them out \u003ca href=\"https://portswigger.net/research/articles\"\u003ehere\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eBotesjuan Repository\u003c/strong\u003e: This is a fantastic resource, especially for learning how to exploit vulnerabilities like XSS to steal cookies rather than just triggering alerts in the browser. You can find it \u003ca href=\"https://github.com/botesjuan/Burp-Suite-Certified-Practitioner-Exam-Study\"\u003ehere\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eBotesjuan YouTube Playlist\u003c/strong\u003e: This \u003ca href=\"https://youtube.com/playlist?list=PLsDxQTEdg_YkVMP6PybE7I-hAdhR7adem\u0026amp;si=1UtLwY27vcw5FGT-\"\u003eplaylist\u003c/a\u003e is a great companion resource, with shoutouts to \u003ca href=\"https://www.youtube.com/c/z3nsh3ll\"\u003ez3nsh3ll\u003c/a\u003e and \u003ca href=\"https://www.youtube.com/c/JohnHammond010\"\u003eJohn Hammond\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003e\u003cstrong\u003eMy Own Site\u003c/strong\u003e: I created a site that mirrors the Botesjuan repository but offers better navigation and includes a section with all payloads. You can visit it \u003ca href=\"https://oscp-7.gitbook.io/bscp-notes\"\u003ehere\u003c/a\u003e.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3 id=\"study-methods\"\u003eStudy Methods\u003c/h3\u003e\n\u003ch4 id=\"initial-preparation\"\u003eInitial Preparation\u003c/h4\u003e\n\u003cp\u003eMy study approach was straightforward: I completed all topics and labs except for the expert ones. After that, I revisited and retook topics where I felt less confident, utilizing all the materials mentioned above—sometimes reading through them multiple times. I also tackled several mystery labs and completed a practice exam, which I highly recommend to familiarize yourself with the exam format.\u003c/p\u003e\n\u003ch4 id=\"portswigger-methodology\"\u003ePortSwigger Methodology\u003c/h4\u003e\n\u003cp\u003eFollowing this, I revisited more mystery labs. You can follow the proposed methodology outlined on the PortSwigger website:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026ldquo;Work through the topics within the academy, completing every apprentice and practitioner-level lab as you go. As you reach the end of each topic, use the mystery labs feature to practice solving the labs with no contextual clues. When you\u0026rsquo;ve completed all the practitioner-level labs, practice solving mystery labs from all available topics to develop your recon and discovery skills. Then complete a practice exam to familiarize yourself with the exam format. Make sure to read the exam hints and tips, as they contain invaluable information that you\u0026rsquo;ll need to be successful in the exam.\u0026rdquo;\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003ch4 id=\"overcoming-challenges\"\u003eOvercoming Challenges\u003c/h4\u003e\n\u003cp\u003eFrom my perspective, if a topic seems challenging, revisit it after taking the practice exam and work on it with mystery labs again. This approach helps solidify your understanding and builds confidence in tackling difficult areas.\u003c/p\u003e\n\u003ch3 id=\"time-commitment\"\u003eTime Commitment\u003c/h3\u003e\n\u003cp\u003eI began my preparation in May and passed the exam in January. Throughout this period, I was working full-time and had various personal commitments, including , brithdays, travels and holidays. Therefore, my timeline may not be representative of what others might experience. In hindsight, I believe that 5-6 months is a reasonable timeframe for preparation. However, if you are organized and have more time to dedicate, you could potentially complete it in 3-4 months. Keep in mind that everyone\u0026rsquo;s experience will vary.\u003c/p\u003e\n\u003ch2 id=\"exam-experience\"\u003eExam Experience\u003c/h2\u003e\n\u003cp\u003eThe exam consists of two applications that closely resemble those found in the labs. Each application involves three main steps:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eGain access to a standard user account (the username is likely \u0026ldquo;carlos\u0026rdquo;).\u003c/li\u003e\n\u003cli\u003eElevate privileges to the administrator account.\u003c/li\u003e\n\u003cli\u003eRetrieve the contents of the file located at \u003ccode\u003e/home/carlos/secret\u003c/code\u003e.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eFor more details, you can read about the exam structure \u003ca href=\"https://portswigger.net/web-security/certification/how-it-works#what-the-exam-involves\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe exam duration is four hours.\u003c/p\u003e\n\u003ch3 id=\"my-tips\"\u003eMy Tips\u003c/h3\u003e\n\u003cp\u003eI passed the exam on my second attempt and discovered various approaches that can be effective. Here are my recommendations:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eStart with Active Scanning\u003c/strong\u003e: Begin by actively scanning both applications simultaneously. This process may take some time, but it’s worth it. As you explore the websites, generate requests and, if you identify any interesting areas, run a scan for specific insertion points or requests.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eUtilize Two Screens\u003c/strong\u003e: If possible, set up a dual-screen configuration. Use one larger screen for Burp Suite and the second for your study materials, protocol documentation, and the exam applications. This setup can significantly enhance your workflow.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eBe Aware of Obfuscation Techniques\u003c/strong\u003e: Remember that the exam may not present obfuscation techniques in the same straightforward manner as the topics covered in the labs. While most labs utilize basic obfuscation, the exam may require you to employ different techniques. Stay alert and be prepared to adapt your strategies accordingly.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eSQL Injection Automation\u003c/strong\u003e: During my first attempt, I struggled with \u003cstrong\u003eSQL injection\u003c/strong\u003e. For the second try I used the \u003cstrong\u003eCO2 extension\u003c/strong\u003e, which allows running \u003cstrong\u003esqlmap\u003c/strong\u003e directly in the system terminal. This was a game-changer because it automated the injection process, freeing up my time to focus on other parts of the exam.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eExtensions and Tools\u003c/strong\u003e Stick to the tools and techniques covered in the \u003cstrong\u003ePortSwigger Academy topics and labs\u003c/strong\u003e. Overcomplicating your approach with unfamiliar tools can waste valuable time. But use some time using it, or use some of newer ones like I used CO for SQL Injection.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003ch2 id=\"reflections\"\u003eReflections\u003c/h2\u003e\n\u003cp\u003ePassing the Burp Suite Exam filled me with a profound sense of accomplishment and relief. The journey was challenging, but it ultimately deepened my passion for penetration testing and web security.\u003c/p\u003e\n\u003cp\u003eFor those preparing for the exam, I want to emphasize that if you find your motivation waning after months or even years due to your current job, remember that achieving such milestones can reignite your drive. If you have doubts, I assure you that the feeling of passing is incredibly rewarding. I can relate to this personally; I created a blog from scratch and wrote this post in just four days. Two months ago, I would have thought that would take me forever.\u003c/p\u003e\n\u003ch2 id=\"conclusion\"\u003eConclusion\u003c/h2\u003e\n\u003cp\u003eIn summary, my journey to passing the \u003ca href=\"https://portswigger.net/web-security/e/c/690adbbe21505dc3\"\u003eBurp Suite Exam\u003c/a\u003e has been both rewarding and enlightening. The key takeaways from this experience include the importance of thorough preparation, the value of utilizing diverse resources, and the necessity of practicing with real-world scenarios.\u003c/p\u003e\n\u003cp\u003eLooking ahead, I am eager to deepen my knowledge in the security field. My immediate plan is to gain more experience, hopefully in a new role as a penetration tester, while further developing my skills through CTF platforms and bug bounty programs. I also aspire to attempt the OSCP again and, one day, speak at DEF CON. This professional dream motivates me and provides a boost to my efforts.\u003c/p\u003e\n\u003cp\u003eBecoming a Burp Suite Certified Practitioner was one of the most challenging yet rewarding experiences of my career. If I can do it, so can you—start your journey today! If you’re considering becoming a Burp Suite Certified Practitioner, I’d love to hear about your journey. For more tips on cybersecurity, penetration testing, CTFs and bug hunting, follow my blog.\u0026quot;\u003c/p\u003e\n",
      "url": "http://localhost:52535/posts/bscp-reflections-and-tips/",
      "date_published": "22016-22-09T10:2222:00+00:00",
      "date_modified": "22016-22-09T10:2222:00+00:00",
      "author": {
        "name": "Blazej Gutowski",
        "url": "http://localhost:52535/"
      }
    }
    
  ]
}